Repository: 84000/data-translation-memory
Catalog: toh350-v3.tmx
Source language: bo
Languages: en

source: གསེར་མདོག་གི་སྔོན་གྱི་སྦྱོར་བ་ཞེས་བྱ་བ། སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ། །
en: The Past Endeavor of Kanakavarṇa Homage to all buddhas and bodhisattvas.

source: འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus did I hear at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་བུ་རྒྱལ་བྱེད་ཀྱི་ཚལ་མགོན་མེད་ཟས་སྦྱིན་གྱི་ཀུན་དགའ་ར་བ་ན། དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་ཐབས་ཅིག་ཏུ་བཞུགས་སོ། །བཅོམ་ལྡན་འདས་ལ་དགེ་སློང་དང་། དགེ་སློང་མ་དང་། དགེ་བསྙེན་དང་།
en: The Blessed One was dwelling at Jetavana, Anāthapiṇḍada’s Park, together with a large monastic community of 1,250 monks.

source: དགེ་བསྙེན་མ་དང་། རྒྱལ་པོ་དང་། བློན་པོ་ཆེན་པོ་དང་། མུ་སྟེགས་ཅན་སྣ་ཚོགས་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། སྤྱོད་པ་པ་དང་། ཀུན་དུ་རྒྱུ་དང་། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་བཀུར་སྟི་བྱས། བླ་མར་བྱས། རི་མོར་བྱས་ཤིང་མཆོད་དོ། །
en: The Blessed One was respected, honored, revered, and venerated by monks, nuns, devoted laymen, devoted laywomen, kings, ministers, the various tīrthikas, ascetics, brahmins, practitioners, and wanderers, as well as by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཆོས་གོས་དང་། ཞལ་ཟས་དང་། གཟིམས་ཆ་དང་། སྙུན་གྱི་རྐྱེན་སྨན་དང་། ལྷ་དང་མི་རྣམས་ཀྱི་ཡོ་བྱད་དམ་པ་རབ་ཏུ་མང་པོ་ཡང་བརྙེས་ཏེ།
en: The Blessed One received abundant and exquisite requisites—robes, alms, bedding and seating, and medicine in case of illness—both divine and human.

source: དེ་དག་ལ་བཅོམ་ལྡན་འདས་རྗེས་སུ་ཆགས་པ་ཡང་མི་མངའ་སྟེ། པད་མ་ལ་ཆུ་མི་ཆགས་པ་དེ་བཞིན་ནོ། །བཅོམ་ལྡན་འདས་ཀྱི་རང་བཞིན་ནི་འདི་ལྟ་སྟེ།
en: Yet, the Blessed One remained untainted by them, like a lotus untainted by water.

source: རྒྱ་ཆེ་ཞིང་དགེ་ལ་གྲགས་པ་དང་སྒྲ་དང་ཚིགས་སུ་བཅད་པས་མངོན་པར་འཕགས་པ་སྟེ། འདི་ལྟར་བཅོམ་ལྡན་འདས་དེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིག་པ་དང་ཞབས་སུ་ལྡན་པ་བདེ་བར་གཤེགས་པ། འཇིག་རྟེན་མཁྱེན་པ། སྐྱེས་བུ་འདུལ་བའི་ཁ་ལོ་སྒྱུར་བ།
en: The Blessed One’s renown, fame, and acclaim, was vast, excellent, and exalted.

source: བླ་ན་མེད་པ། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ། ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་དང་བདུད་དང་བཅས་པ་དང་ཚངས་པ་དང་བཅས་དགེ་སྦྱོང་དང་བྲམ་ཟེར་བཅས་པ་དང་ལྷ་དང་མིར་བཅས་པ་འདི་རྣམས་རང་གི་མངོན་པར་མཁྱེན་པས་མངོན་སུམ་དུ་མཁྱེན་པར་མཛད་ནས་དམ་པའི་ཆོས་སྟོན་ཏེ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དགེ་བ། རྣམ་པར་བྱང་བ། ཚངས་པར་སྤྱོད་པ། ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །
en: In this way, the Blessed One, the tathāgata, arhat, perfectly awakened one, accomplished in knowledge and conduct, the well gone one, the knower of the world, the unsurpassed guide for people to be tamed, the teacher of gods and humans, the Buddha, the Blessed One, having directly understood and clearly perceived this world with its gods, māras, brahmās, ascetics, brahmins, gods, and humans, was teaching the Dharma that is excellent in the beginning, excellent in the middle, and excellent in the end, fine in meaning and fine in expression, and was expounding the entire and complete spiritual life that is completely pure and completely clean.

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ། དགེ་སློང་དག་ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་དང་སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་ཤེས་པ་ལྟར། སེམས་ཅན་རྣམས་ཀྱིས་ཀྱང་སྦྱིན་པའི་འབྲས་བུ་དང་སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་ཤེས་པར་གྱིས་ཤིག །གང་འདི་ཁམ་ཕྱི་མའི་ཁམ་ཕྱི་མ་གཅིག་པོ་དེ་ཡང་། གཞན་དག་ལ་མ་བྱིན་མ་བགོས་པར་བདག་གིས་མི་བཟའ་བར་གྱིས་ཤིག །སེར་སྣའི་སེམས་ཀྱི་དྲི་མ་སྐྱེས་པས་ཀུན་ནས་དཀྲིས་ཏེ་མ་འདུག་ཅིག །
en: Then the Blessed One addressed the monks, “Monks, if beings were to know the fruit of giving and the karmic fruition of sharing gifts as I know the fruit of giving and the karmic fruition of sharing gifts, they would not eat even their last mouthful, their last morsel, themselves without giving, without sharing it with others, and the arisen defilement of selfishness would not remain in possession of their minds.

source: དགེ་སློང་དག་གང་གི་ཕྱིར་ཇི་ལྟར་ངས་སྦྱིན་པའི་འབྲས་བུ་དང་། སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་ཤེས་པ་ལྟར། སེམས་ཅན་རྣམས་ནི་སྦྱིན་པའི་འབྲས་བུ་དང་སྦྱིན་པ་ལ་འགེད་པའི་རྣམ་པར་སྨིན་པ་མི་ཤེས་ཏེ། དེ་ལྟ་བས་ན་སེམས་ཅན་རྣམས་གང་འདི་ཁམ་ཕྱི་མའི་ཁམ་ཕྱི་མ་གཅིག་པོ་དེ་ཡང་། གཞན་དག་ལ་མ་བྱིན་མ་བགོས་པར་བདག་ཉིད་ཟ་བར་བྱེད། སེར་སྣའི་སེམས་ཀྱི་དྲི་མ་སྐྱེས་པས་ཀུན་ནས་དཀྲིས་ཏེ་འདུག་གོ། །
en: But, monks, because beings do not know the fruit of giving and the karmic fruition of sharing gifts as I know the fruit of giving and the karmic fruition of sharing gifts, they eat even their last mouthful, their last morsel, themselves without giving, without sharing it with others, and the arisen defilement of selfishness remains in possession of their minds.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Why is this?

source: དགེ་སློང་དག་སྔོན་བྱུང་བ་འདས་པའི་དུས་ན། རྒྱལ་པོ་གསེར་མདོག་ཅེས་བྱ་བ། གཟུགས་བཟང་བ་མཛེས་པ་བལྟ་ན་སྡུག་པ་ཁ་དོག་བཟང་པོ་རྒྱས་པ་མཆོག་དང་ལྡན་པ་ཞིག་བྱུང་ངོ་། །
en: “Previously, monks, in a past time, there was a king named Kanakavarṇa, who was handsome, beautiful, and pleasing to behold, being endowed with a sublime golden complexion.

source: རྒྱལ་པོ་གསེར་མདོག་དེ་ཕྱུག་སྟེ་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་ཞིང་བདག་དབང་བ་མང་བ་དང་། དབྱིག་དང་ཡོ་བྱད་མང་བ་དང་། ནོར་དང་། འབྲུ་དང་། ནོར་བུ་དང་། མུ་ཏིག་དང་། མན་ཤེལ་དང་། བྱི་རུ་མང་བ་དང་། གསེར་དང་། དངུལ་མང་བ་དང་། གླང་པོ་ཆེ་དང་། རྟ་དང་། བ་ལང་དང་། རྟ་རྒོད་མ་མང་བ་དང་། མཛོད་དང་། བང་བ་ཡོངས་སུ་གང་བ་ཞིག་བྱུང་ངོ་། །
en: That king Kanakavarṇa was rich, wealthy, and prosperous, having abundant possessions; abundant wealth and means; abundant riches, grains, gems, pearls, crystal, coral, gold, and silver; abundant elephants, horses, cows, and stud horses; and treasuries and storehouses that were completely filled.

source: རྒྱལ་པོ་གསེར་མདོག་གི་ཕོ་བྲང་གྲོང་ཁྱེར་གསེར་ཅན་ཞེས་བྱ་བར་བཏགས་ཏེ། ཆུར་ནི་ཤར་ནས་ནུབ་ཏུ་དཔག་ཚད་བཅུ་གཉིས་ཡོད་དོ། །ཞེང་ནི་ལྷོ་ནས་བྱང་དུ་དཔག་ཚད་བདུན་ཡོད་དེ། འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་ཞིང་སྐྱེ་བོ་དང་མི་མང་པོ་རྣམས་ཀྱིས་གང་ངོ་། །རྒྱལ་པོ་གསེར་མདོག་ལ་གྲོང་ཁྱེར་བརྒྱད་ཁྲི་ཡོད་དེ། །
en: “King Kanakavarṇa had a royal capital called Kanakāvatī that was twelve yojanas in length from east to west and seven yojanas wide from south to north.

source: འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་ཞིང་སྐྱེ་བོ་མང་པོ་དང་མི་མང་པོ་རྣམས་ཀྱིས་གང་ངོ་། །
en: It was prosperous, thriving, happy, well provisioned, pleasant, and bustling with many people.

source: གྲོང་ས་ཡ་ཕྲག་ལྔ་བདུན་འབུམ་ཡོད་དེ། འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་ཞིང་སྐྱེ་བོ་དང་མི་མང་པོ་རྣམས་ཀྱིས་གང་ངོ་། །རི་འོར་བ་དྲུག་ཁྲི་ཡོད་དེ། འབྱོར་པ་དང་། རྒྱས་པ་དང་།
en: King Kanakavarṇa had eighty thousand such cities that were prosperous, thriving, happy, well provisioned, pleasant, and bustling with many people; five hundred and seventy million villages that were prosperous, thriving, happy, well provisioned, pleasant, and bustling with many people; and sixty thousand market towns that were prosperous, thriving, happy, well provisioned, pleasant, and bustling with many people.

source: བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་ཞིང་སྐྱེ་བོ་དང་མི་མང་པོ་རྣམས་ཀྱིས་གང་ངོ་། །རྒྱལ་པོ་གསེར་མདོག་གི་བློན་པོ་ཁྲི་བརྒྱད་སྟོང་ཡོད་དོ། །བུད་མེད་སླས་ཉི་ཁྲི་ཡོད་པར་གྱུར་ཏོ། །
en: And, King Kanakavarṇa had eighteen thousand courtiers and a retinue of twenty thousand attendant women.

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་ཆོས་དང་ལྡན་པའི་ཆོས་ཀྱི་རྒྱལ་པོའི་ཆོས་ཀྱིས་རྒྱལ་སྲིད་བྱེད་པར་གྱུར་ཏོ། །
en: “Monks, King Kanakavarṇa was righteous and he ruled his kingdom according to the Dharma as a Dharma king.

source: རྒྱལ་པོ་གསེར་མདོག་ཐམས་ཅད་སྦྱིན་པར་བྱེད་དེ། དེས་ཐ་ན་རང་གི་ལུས་ཀྱི་ཤ་མན་ཆད་ཡོངས་སུ་མི་གཏོང་བ་ཅི་ཡང་མེད་དོ། །
en: He engaged in all acts of generosity and there was nothing that he had not given away, including the flesh of his own body.

source: དེའི་དུས་ན་མི་རྣམས་ཀྱི་ཚེའི་ཚད་ལོ་བརྒྱད་ཁྲི་བཞི་སྟོང་ཐུབ་པར་གྱུར་ཏོ། །
en: During those times people would attain a lifespan of eighty-four thousand years.

source: དེའི་ཚེ་དུས་གཞན་ཞིག་ན། རྒྱལ་པོ་གསེར་མདོག་གཅིག་པུ་དབེན་པར་ནང་དུ་ཡང་དག་འཇོག་ལ་ཞུགས་ནས། སེམས་ཀྱིས་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་འདི་སྙམ་དུ་སྐྱེས་ཏེ། གང་བདག་གིས་ངེས་པར་ཚོང་པ་ཐམས་ཅད་ལ་ནི། ལ་གཅན་དང་ཤོ་གམ་རྣམས་མི་དབབ་པར་བྱའོ། །
en: “Now, at one time, when King Kanakavarṇa was alone, having withdrawn in private, a deliberation arose in his mind: ‘Let me free all merchants from customs duties and transit fees.

source: འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལ་ནི་དཔྱ་དང་སྒྱུ་རྣམས་མི་དབབ་པར་བྱའོ་སྙམ་མོ། །དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས། རྩིས་པ་དང་། སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་།
en: Let me free all the people of Jambudvīpa from taxes and fees.’

source: བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་རྣམས་བོས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །དེང་ཕྱིན་ཅད་གྲོང་མི་དང་ཚོང་པ་ཐམས་ཅད་ལ་ལ་གཅན་དང་ཤོ་གམ་རྣམས་མི་དབབ་པར་བྱའོ། །
en: “King Kanakavarṇa thereupon summoned his accountants, ministers, courtiers, gatekeepers, and councilors, and announced to them, ‘As of today, sirs, all merchants should be freed from customs duties and transit fees.

source: འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལ་དཔྱ་དང་སྒྱུ་རྣམས་མི་དབབ་པར་བྱའོ་ཞེས་བསྒོའོ། །
en: All the people of Jambudvīpa should be freed from taxes and fees.’

source: དེའི་ཐབས་འདིས་ལོ་མང་པོ་ཞིག་ཏུ་རྒྱལ་སྲིད་བྱེད་པ་ན། དུས་གཞན་ཞིག་གི་ཚེ་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཆར་མི་འབབ་པའི་རྒྱུ་སྐར་ངན་པ་ཞིག་བྱུང་བར་གྱུར་ཏོ། །དེའི་ཚེ་བྲམ་ཟེ་མཚན་ཉིད་འདོན་པ་དང་། ལྟས་པ་དང་། མོ་བ་རྣམས་ས་དང་།
en: “While ruling his kingdom by these means for many years, at a certain time, the constellations became adverse such that it would not rain for twelve years.

source: བར་སྣང་གི་རྒྱུ་སྐར་དང་།
en: The brahmins who could understand the indications read the signs and did divinations.

source: གཟའ་དང་། པ་བ་སངས་རྒྱུ་བ་དག་དེ་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་ཤེས་པར་བྱས་ནས། རྒྱལ་པོ་གསེར་མདོག་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་རྒྱལ་པོ་གསེར་མདོག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛོད་ཅིག །དགུང་ལོ་བཅུ་གཉིས་ཀྱི་བར་དུ་ཆར་མི་འབབ་པའི་རྒྱུ་སྐར་ངན་པ་དེ་བྱུང་བར་གྱུར་ཏོ། །
en: Having observed this in the movements of the constellations and the planet Venus, they went to King Kanakavarṇa and said, ‘Your Majesty, please know that the constellations have become adverse such that it will not rain for twelve years.’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་དངོས་པོ་བསྒྲགས་པ་དེ་ཐོས་ནས། རབ་ཏུ་ངུས་ཏེ་མཆི་མ་ཕྱུང་ནས་ཨེ་མའོ་ངའི་འཛམ་བུའི་གླིང་གི་མི་རྣམས། ཨེ་མའོ་ཨེ་མའོ། །
en: “Upon hearing this news, King Kanakavarṇa broke down in tears, ‘Oh, my people of Jambudvīpa!

source: ངའི་འཛམ་བུའི་གླིང་གི་མི་རྣམས་ཨེ་མའོ་ཨེ་མའོ། །
en: Oh, my people of Jambudvīpa!

source: ངའི་འཛམ་བུའི་གླིང་འབྱོར་པ་དང་། རྒྱས་པ་དང་། བདེ་བ་དང་། ལོ་ལེགས་པ་དང་། ཉམས་དགའ་ཞིང་སྐྱེ་བོ་དང་མི་མང་པོས་གང་བ་རྣམས་རིང་པོར་མི་ཐོགས་པ་ཉིད་དུ་སྟོང་ཞིང་མི་དང་འབྲལ་བར་འགྱུར་རོ། །
en: Oh, my Jambudvīpa that is prosperous, thriving, happy, well provisioned, pleasant, and bustling with many people—before long you will be empty and bereft of people!’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་ཡུད་ཙམ་ཞིག་མྱ་ངན་དང་སྨྲེ་སྔགས་འདོན་པ་སངས་ནས། འདི་སྙམ་དུ་གྱུར་ཏེ། གང་འདི་ཕྱུག་ཅིང་ནོར་མང་ལ་ལོངས་སྤྱོད་ཆེ་བ་དེ་དག་ནི་འཚོ་བར་ནུས་ཀྱི། གང་འདི་དབུལ་ཞིང་ནོར་ཉུང་ལ་བཟའ་བཏུང་དང་། ལོངས་སྤྱོད་ཆུང་བ་དེ་དག་ནི། ཅི་ལྟར་བྱེད་ཅིག་གུ །དེ་འདི་སྙམ་དུ་གྱུར་ཏེ། བདག་གིས་ངེས་པར་འཛམ་བུའི་གླིང་གི་ཟས་ལ་སོགས་པ་ཐམས་ཅད་བསྡུ་བར་བྱའོ། །ཟས་ལ་སོགས་པ་བསྡུས་ཏེ། གྲོང་དང་།
en: “After weeping sorrowfully for a moment, King Kanakavarṇa thought, ‘Those who are rich, wealthy, and prosperous will be able to support themselves, but those who are poor, with little wealth, and with little to eat and drink—how will they survive?

source: གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་དུ་བང་བ་གཅིག་བརྩིག་པར་བྱའོ། །བང་བ་གཅིག་བརྩིགས་ཏེ། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་བཟའ་བ་མཉམ་པར་བགོ་བར་བྱའོ་སྙམ་མོ། །དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས། རྩིས་པ་དང་། སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་། བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་རྣམས་བོས་ཏེ། འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་དག་ཁྱེད་རྣམས་དེང་ལ་འཛམ་བུའི་གླིང་གི་ཟས་ལ་སོགས་པ་ཐམས་ཅད་སྡུས་ཤིག །ཟས་ལ་སོགས་པ་བསྡུས་ཏེ། གཅོལ་ལ་གྲོངས་ཤིག །
en: Let me collect all the foodstuffs in Jambudvīpa, build a storehouse for all the villages, cities, and market towns, as well as for the royal capital, and distribute an equal share to all the people of Jambudvīpa.’

source: གཅལ་ཏེ་བགྲངས་ནས། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་དུ་བང་བ་བཟང་པོ་གཅིག་རྩིགས་ཤིག་ཅེས་བསྒོའོ། །དེ་ནས་རྩིས་པ་དང་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དང་། བློན་པོ་དང་། སྒོ་བ་དང་། འཁོར་རྣམས་ཀྱིས་རྒྱལ་པོ་གསེར་མདོག་གི་ལྟར་མཉན་ནས། འཛམ་བུའི་གླིང་གི་ཟས་ལ་སོགས་པ་ཐམས་ཅད་བསྡུས་སོ། །ཟས་ལ་སོགས་པ་བསྡུས་ནས། གཅལ་བགྲངས་ཏེ། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་རྣམས་སུ་བང་བ་གཅིག་བྱས་ནས་བླུགས་སོ། །བང་བ་གཅིག་བྱས་ནས་བླུགས་ཏེ། རྒྱལ་པོ་གསེར་མདོག་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས། རྒྱལ་པོ་གསེར་མདོག་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ལྷ་མཁྱེན་པར་མཛོད་ཅིག །
en: “King Kanakavarṇa then summoned his accountants, ministers, courtiers, gatekeepers, and councilors, and ordered, ‘Sirs, go and collect all the foodstuffs in Jambudvīpa, count them and measure them out, and place them in a storehouse for all the villages, cities, and market towns, as well as for the royal capital.’

source: གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་ཀྱི་ཟས་ལ་སོགས་པ་བསྡུས་སོ། །བསྡུས་ནས་ཀྱང་གཅལ་ཞིང་བགྲངས་ལགས་སོ། །
en: “The accountants, ministers, courtiers, gatekeepers, and councilors did as King Kanakavarṇa had ordered, and when they had stored the foodstuffs in the storehouse, they went to King Kanakavarṇa and said, ‘Your Majesty, please know that the foodstuffs from all the villages, cities, and market towns, as well as from the royal capital, have all been collected, counted, measured out, and stored in a storehouse for all the villages, cities, and market towns, as well as for the royal capital.

source: གཅལ་ཞིང་བགྲངས་ནས། གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་།
en: What does Your Majesty deem fit now?’

source: རྒྱལ་པོའི་ཕོ་བྲང་འཁོར་ཐམས་ཅད་དུ་བང་བ་བགྱིས་ནས་སྩལ་ལགས་ཀྱིས། ཁྱོད་གང་གི་དུས་ཉིད་དགོངས་སམ། དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས་གྲངས་པ་དང་། རྩིས་པ་དང་ཡི་གེ་པའི་མི་རྣམས་བོས་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །གྲོང་གི་གཙོ་བོ་དག་ཁྱེད་རྣམས་དེང་ལ།
en: “King Kanakavarṇa then summoned his counters, accountants, and scribes and ordered, ‘Sirs, go and count all the people of Jambudvīpa.

source: འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་གྲོངས་ཤིག །ང་མན་ཆད་ལེགས་པར་གྲོངས་ལ། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ཀྱི་བཟའ་བ་ལེགས་པར་མཉམ་པར་བགོ་བར་གྱིས་ཤིག །
en: Having properly counted everyone starting with myself, properly distribute an equal share of food to all the people of Jambudvīpa.’

source: གྲངས་པ་དང་རྩིས་པ་དང་ཡི་གེ་པའི་མི་རྣམས་ཀྱིས་རྒྱལ་པོ་གསེར་མདོག་གི་ལྟར་མཉན་ནས། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལེགས་པར་བགྲངས་སོ། །
en: “The counters, accountants, and scribes obeyed and they properly counted all the people of Jambudvīpa.

source: རྒྱལ་པོ་གསེར་མདོག་མན་ཆད་ལེགས་པར་བགྲངས་ནས། འཛམ་བུའི་གླིང་གི་མི་ཐམས་ཅད་ལ་བཟའ་བ་མཉམ་པར་འགེད་དོ། །
en: When they had properly counted everyone, starting with King Kanakavarṇa, they assigned an equal share of food to all the people of Jambudvīpa.

source: ལོ་བཅུ་གཅིག་གི་བར་དུ་ནི་ཤི་བ་མེད་དོ། །ལོ་བཅུ་གཉིས་པ་བྱུང་བའི་ཚེ་ཟླ་བ་གཅིག་ལ་དེར་མང་དུ་སྐྱེས་པ་དང་བུད་མེད་དང་ཁྱེའུ་དང་བུ་མོ་རྣམས་བཀྲེས་པ་དང་སྐོམ་པས་ཤིའོ། །ལོ་བཅུ་གཉིས་པ་བྱུང་བའི་ཚེ།
en: “For eleven years everyone survived, but during the first month of the twelfth year, many men, women, and children began to die from hunger and thirst.

source: ཟླ་བ་ལྷག་མ་གཉིས་དང་། གསུམ་དང་། བཞི་དང་། ལྔ་དང་། བཅུ་གཅིག་གི་བར་དུ་དེར་མང་དུ་སྐྱེས་པ་དང་བུད་མེད་དང་ཁྱེའུ་དང་བུ་མོ་རྣམས་ཤི་བར་གྱུར་ཏོ། །
en: As the second, third, fourth, and fifth months passed, many more men, women, and children died.

source: དེའི་ཚེ་ན་འཛམ་བུའི་གླིང་གི་ཟས་ལ་སོགས་པ་ཐམས་ཅད་ཡོངས་སུ་ཟད་དེ། །གཞན་དུ་ན་རྒྱལ་པོ་གསེར་མདོག་ལ་ཟས་ཀྱི་ལྷག་མ་བྲེའུ་ཆུང་གང་ཞིག་ཡོད་དོ། །
en: This went on until the eleventh month, when all the food in Jambudvīpa had been exhausted, apart from a single measure of food left for King Kanakavarṇa.

source: དེའི་ཚེ་དུས་གཞན་ཞིག་ན། བསྐལ་པ་བཞི་བཅུར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཞིག་མི་མཇེད་ཀྱི་འཇིག་རྟེན་གྱི་ཁམས་འདིར་ཕྱིན་པར་གྱུར་ཏོ། །
en: “Now, at that time, there was a bodhisattva who had been embarked upon the path for forty eons and who had reached this Sahā world.

source: བྱང་ཆུབ་སེམས་དཔའ་དེས་གཞན་ཞིག་ཏུ། ནགས་ཁྲོད་ཞིག་ན། བུ་དང་མ་གཉིས་ཉལ་པོ་བྱེད་པ་ཞིག་མཐོང་ངོ་། །
en: That bodhisattva saw, somewhere in a forest, a son having sexual intercourse with his mother.

source: མཐོང་ནས་ཀྱང་འདི་སྙམ་དུ་གྱུར་ཏེ། ཨེ་མའོ་ཉོན་མོངས་སོ། །སེམས་ཅན་འདི་དག་ནི་ཉོན་མོངས་སོ། །
en: Seeing this, he thought, ‘Oh, how defiled, how defiled these beings are!

source: གང་གི་ཚེ་ཟླ་བ་དགུ་རུམ་དེ་ཉིད་དུ་གནས་ལ། དེ་ཉིད་ཀྱི་ནུ་མ་ལ་འཐུངས་ནས། དེ་ཉིད་དུ་དེ་ལྟར་བྱེད།
en: It was in her womb that he stayed for nine months and it was from her breasts that he drank—and now he does this here!

source: འདི་འདྲ་བའི་སེམས་ཅན་ཆོས་མ་ཡིན་པའི་འདོད་ཆགས་ཀྱིས་ཞེན་པ། ལོག་པར་ལྟ་བ་འདོད་པ་མི་བཟད་པས་ཟིལ་གྱིས་ནོན་པ། ཕར་མི་འཛིན་པ། མར་མི་འཛིན་པ། དགེ་སྦྱོང་དུ་མི་འཛིན་པ། བྲམ་ཟེར་མི་འཛིན་པ། རིགས་ཀྱི་རྒན་རབས་ལ་བཀུར་སྟི་མི་བྱེད་པ་རྣམས་ཀྱིས་བདག་ཆོག་སྟེ།
en: I’ve had enough of such beings who are driven by craven desires not in keeping with the Dharma, who have wrong views, who are overcome by unbearable lust, who do not honor their fathers, their mothers, monks, or brahmins, and who do not respect the elders of their family.

source: འདི་འདྲ་བའི་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ། བྱང་ཆུབ་ཀྱི་སྤྱོད་པ་སྤྱད་པར་སུ་ཞིག་སྤྲོ།
en: Who would bother to practice the conduct of a bodhisattva for the sake of such beings?

source: བདག་ནི་ངེས་པར་བདག་གཅིག་པུའི་དོན་བསྒྲུབ་པོ་སྙམ་མོ། །
en: Surely I should practice for my own sake alone.’

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་གཞན་དུ་ཤིང་ལྗོན་པའི་དྲུང་ག་ན་བ་དེར་སོང་སྟེ་ཕྱིན་ནས།
en: “Then the bodhisattva went to a tree and sat down at its base.

source: ཤིང་ལྗོན་པའི་དྲུང་དེར་སྐྱིལ་མོ་ཀྲུང་བཅས་ནས་ལུས་བསྲང་སྟེ། དགའ་བ་དང་བདེ་བ་དང་དྲན་པ་མངོན་དུ་བཞག་ནས་འདུག་གོ། །
en: Having crossed his legs and made his body upright, he established mindfulness to the fore.

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་དེ་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་རྣམས་ལ། སྐྱེ་བ་དང་འཇིག་པར་རྗེས་སུ་ལྟ་ཞིང་གནས་ཏེ། འདི་ནི་གཟུགས་ཏེ། གཟུགས་འདི་ནི་སྐྱེ་བའོ། །གཟུགས་འདི་ནི་འཇིག་པའོ། །འདི་ནི་ཚོར་བ། འདི་ནི་འདུ་ཤེས། འདི་ནི་འདུ་བྱེད། འདི་ནི་རྣམ་པར་ཤེས་པ་སྟེ།
en: He then dwelled on observing the arising and passing away of the five aggregates that are subject to clinging: ‘This is form, this is the arising of form, this is the vanishing of form; this is feeling; this is perception; these are conditionings; this is consciousness, this is the arising of consciousness, this is the vanishing of consciousness.’

source: རྣམ་པར་ཤེས་པ་འདི་ནི་སྐྱེ་བའོ། །རྣམ་པར་ཤེས་པ་འདི་ནི་འཇིག་པའོ་ཞེས་དེ་ཉེ་བར་ལེན་པའི་ཕུང་པོ་ལྔ་པོ་འདི་རྣམས་ལ་སྐྱེ་བ་དང་འཇིག་པར་རྗེས་སུ་ལྟ་ཞིང་གནས་སོ། །གང་ཅུང་ཟད་སྐྱེ་བའི་ཆོས་དེ་ཐམས་ཅད་ནི། ཡུན་མི་རིང་བ་ཉིད་དུ་འགག་པའི་ཆོས་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་ནས། དེ་ཉིད་དུ་རང་བྱང་ཆུབ་རྗེས་སུ་ཐོབ་བོ། །
en: As he remained like this, observing the arising and passing away of the five aggregates that are subject to clinging, before long, he realized that whatever is of the nature to arise is all of the nature to cease, and right there he reached individual awakening.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེའི་རྐྱེན་ཇི་ལྟ་བ་བཞིན་གྱིས། ཆོས་ཐོབ་པ་མཐོང་ནས། དེའི་ཚེ་ཚིགས་སུ་བཅད་པ་འདི་དག་སྨྲས་པ། ཡང་དག་བསྙེན་ནས་ཆགས་གྱུར་ལ། །ཆགས་ལས་སྡུག་བསྔལ་འདི་བྱུང་སྟེ། །
en: “Thereupon, after beholding the dharmas attained according to their conditions, on that occasion the blessed pratyekabuddha spoke this verse: Keeping close company, one comes to have attachments; It is from attachment that this suffering comes about.

source: ཆགས་ལ་སྡུག་བསྔལ་འདི་འཇུག་པས། །དེ་ཕྱིར་མཁས་པས་ཆགས་སུན་ཕྱུང་། །བསེ་རུ་ལྟ་བུར་གཅིག་པུ་སྤྱད། །
en: Realizing the danger coming from attachment, One should move alone like a rhinoceros.

source: དེ་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ་འདི་སྙམ་དུ་གྱུར་ཏེ། བདག་གིས་སེམས་ཅན་རྣམས་ཀྱི་ཕྱིར་དཀའ་བ་མང་ཞིག་སྤྱད་པས་ན་སུལ་ཡང་ཕན་པ་བྱས་པ་མ་ཡིན་ཏེ།
en: “Then the blessed pratyekabuddha thought, ‘I have performed many difficult deeds for the sake of sentient beings, but no one has yet been benefitted.

source: བདག་གིས་དེང་སུ་ཞིག་ལ་སྙིང་བརྩེ་བར་བྱ་ཞིང་།
en: To whom should I now extend my compassion?

source: བདག་གིས་དེང་སུ་ཞིག་ལ་བསོད་སྙོམས་བླངས་ཏེ། ཡོངས་སུ་བཟའ་བར་བྱ་སྙམ་མོ། །
en: Whose alms should I now receive and eat?’

source: དེ་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ་མི་ལས་ཤིན་ཏུ་འདས་པའི་ལྷའི་སྤྱན་གྱིས་འཛམ་བུའི་གླིང་འདི་ཀུན་དུ་བལྟས་པ་དང་། བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེས་འཛམ་བུའི་གླིང་གི་ཟས་ལ་སོགས་པ་ཡོངས་སུ་ཟད་པར་མཐོང་སྟེ། གཞན་དུ་ན་རྒྱལ་པོ་གསེར་མདོག་ལ་ཟས་ཀྱི་ལྷག་མ་བྲེའུ་ཆུང་གང་ཞིག་ཡོད་དོ། །
en: “The blessed pratyekabuddha surveyed the whole of Jambudvīpa with his superhuman divine vision, and he saw that all the food in Jambudvīpa had been exhausted apart from a single measure of food left for King Kanakavarṇa.

source: དེ་འདི་སྙམ་དུ་གྱུར་ཏེ། བདག་གིས་ངེས་པར་རྒྱལ་པོ་གསེར་མདོག་ལ་སྙིང་བརྩེ་བར་བྱ་ཞིང་།
en: He then thought, ‘Let me extend my compassion to King Kanakavarṇa.

source: བདག་གིས་ངེས་པར་རྒྱལ་པོ་གསེར་མདོག་ལ་ཟས་ཀྱི་ལྷག་མ་བྲེའུ་ཆུང་གང་ཞིག་ཡོད་པ་ལས་བླངས་ཏེ་ཡོངས་སུ་བཟའ་བར་བྱའོ་སྙམ་མོ། །
en: Let me receive and eat the single measure of food that is left for King Kanakavarṇa.’

source: དེ་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ། དེའི་རྫུ་འཕྲུལ་འདི་ལྟ་བུས་ནམ་མཁའ་ལ་མངོན་སུམ་དུ་སོང་སྟེ། ལུས་སྣང་བར་བྱ་བཞིན་དུ་རྫུ་འཕྲུལ་གྱིས་རྒྱལ་པོའི་ཕོ་བྲང་གསེར་ཅན་གང་ན་བ་དེར་སོང་ངོ་། །
en: “Then the blessed pratyekabuddha, by such miraculous ability of his, rose up into the sky, and, like a bird in bodily appearance, through his miraculous ability, proceeded to the royal capital Kanakāvatī.

source: དེའི་ཚེ་རྒྱལ་པོ་གསེར་མདོག་བློན་པོ་ལྔ་སྟོང་ཙམ་དང་། ཁང་བཟངས་ཀྱི་སྟེང་ན་འཁོད་པར་གྱུར་ཏོ། །
en: “At that time King Kanakavarṇa was on the palace terrace, accompanied by five thousand courtiers.

source: བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ། རྒྱང་རིང་པོ་ནས་འདི་ལྟར་འོང་བ་ན། སྣ་ཆེན་པོ་ལ་གཏོགས་པ་གཅིག་གིས་མཐོང་ངོ་། །
en: One minister saw the blessed pratyekabuddha coming from a distance.

source: མཐོང་ནས་སྣ་ཆེན་པོ་ལ་གཏོགས་པ་དག་བོས་ནས། གྲོང་གི་གཙོ་བོ་དག་ལྟོས་ཤིག །
en: Seeing this, he called the other ministers, ‘Look, sirs, look!

source: འདི་ལྟར་རྒྱང་རིང་པོ་ནས་བྱ་དམར་པོ་འཕུར་བ་ཞིག་འོང་ངོ་། །
en: From the distance, a red-winged bird is coming toward us here!’

source: སྣ་ཆེན་པོ་ལ་གཏོགས་པ་གཉིས་པས་སྨྲས་པ། གྲོང་གི་གཙོ་བོ་དག་འདི་ནི་བྱ་དམར་པོ་འཕུར་བ་མ་ཡིན་གྱི། འདི་ནི་སྲིན་པོ་མདངས་འཕྲོག་པ་ཞིག་འོང་སྟེ།
en: “Another minister said, ‘Sirs, this is not a red-winged bird—it’s a life-robbing demon that is coming here!

source: འདིས་ནི་དེང་བདག་ཅག་ཟོས་པར་འགྱུར་རོ། །
en: It is now going to devour us!’

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་ལག་པ་གཉིས་ཀས་བཞིན་ལེགས་པར་ཕྱིས་ཏེ། སྣ་ཆེན་པོ་རྣམས་ལ་སྨྲས་པ། གྲོང་གི་གཙོ་བོ་དག་འདི་ནི་བྱ་དམར་པོ་འཕུར་བ་མ་ཡིན་ལ། སྲིན་པོ་མདངས་འཕྲོག་པ་ཡང་མ་ཡིན་ནོ། །འདི་ནི་དྲང་སྲོང་སྟེ།
en: “Then King Kanakavarṇa rubbed his face with both hands and said to the ministers, ‘Sirs, this is not a red-winged bird, nor is it a life-robbing demon—it’s a sage who is coming out of compassion for us!’

source: བདག་ཅག་ལ་སྙིང་བརྩེ་བའི་ཕྱིར་འོང་ངོ་། །དེ་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ། རྒྱལ་པོ་གསེར་མདོག་གི་ཁང་བཟངས་ཀྱི་སྟེང་དུ་བབས་སོ། །
en: “Thereupon that blessed pratyekabuddha alighted on top of King Kanakavarṇa’s palace.

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་ལངས་ནས་བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ་བསུས་ནས། བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེའི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། སྟན་བཤམས་པ་ལ་བཞུགས་པར་གསོལ་ཏོ། །
en: Rising from his seat, King Kanakavarṇa welcomed the blessed pratyekabuddha, bowed his head at the feet of the blessed pratyekabuddha, and invited him to sit on a seat that had been prepared.

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་གིས། བཅོམ་ལྡན་འདས་རང་སངས་རྒྱས་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དྲང་སྲོང་ཅིའི་ཕྱིར་འདིར་བྱོན།
en: King Kanakavarṇa then asked the blessed pratyekabuddha, ‘Sage, for what purpose have you come here?’

source: དྲང་སྲོང་གིས་སྨྲས་པ། རྒྱལ་པོ་ཆེན་པོ་ཟས་ཀྱི་ཕྱིར་རོ། །
en: “‘For the purpose of food, great king,’ the sage replied.

source: དེ་ནས་རྒྱལ་པོ་གསེར་མདོག་རབ་ཏུ་ངུས་ཏེ་མཆི་མ་ཕྱུང་ནས།
en: “Upon this, King Kanakavarṇa was very distraught, and weeping, he cried, ‘Oh, how poor I am!
